grevaillot/svd_tools/headers/ATSAMV71J21/afec0.h
/** AFEC0_AFEC_ISR_TEMPCHG Temperature Change (cleared on read) **/
#define AFEC0_AFEC_ISR_TEMPCHG		(1 << 30)
/** AFEC0_AFEC_ISR_COMPE Comparison Error (cleared by reading AFEC_ISR) **/
#define AFEC0_AFEC_ISR_COMPE		(1 << 26)
/** AFEC0_AFEC_ISR_GOVRE General Overrun Error (cleared by reading AFEC_ISR) **/
#define AFEC0_AFEC_ISR_GOVRE		(1 << 25)
/** AFEC0_AFEC_ISR_DRDY Data Ready (cleared by reading AFEC_LCDR) **/
#define AFEC0_AFEC_ISR_DRDY		(1 << 24)
/** AFEC0_AFEC_ISR_EOC11 End of Conversion 11 (cleared by reading AFEC_CDRx) **/
#define AFEC0_AFEC_ISR_EOC11		(1 << 11)
/** AFEC0_AFEC_ISR_EOC10 End of Conversion 10 (cleared by reading AFEC_CDRx) **/
#define AFEC0_AFEC_ISR_EOC10		(1 << 10)
/** AFEC0_AFEC_ISR_EOC9 End of Conversion 9 (cleared by reading AFEC_CDRx) **/
#define AFEC0_AFEC_ISR_EOC9		(1 << 9)
/** AFEC0_AFEC_ISR_EOC8 End of Conversion 8 (cleared by reading AFEC_CDRx) **/
#define AFEC0_AFEC_ISR_EOC8		(1 << 8)
/** AFEC0_AFEC_ISR_EOC7 End of Conversion 7 (cleared by reading AFEC_CDRx) **/
#define AFEC0_AFEC_ISR_EOC7		(1 << 7)
/** AFEC0_AFEC_ISR_EOC6 End of Conversion 6 (cleared by reading AFEC_CDRx) **/
#define AFEC0_AFEC_ISR_EOC6		(1 << 6)
/** AFEC0_AFEC_ISR_EOC5 End of Conversion 5 (cleared by reading AFEC_CDRx) **/
#define AFEC0_AFEC_ISR_EOC5		(1 << 5)
/** AFEC0_AFEC_ISR_EOC4 End of Conversion 4 (cleared by reading AFEC_CDRx) **/
#define AFEC0_AFEC_ISR_EOC4		(1 << 4)
/** AFEC0_AFEC_ISR_EOC3 End of Conversion 3 (cleared by reading AFEC_CDRx) **/
#define AFEC0_AFEC_ISR_EOC3		(1 << 3)
/** AFEC0_AFEC_ISR_EOC2 End of Conversion 2 (cleared by reading AFEC_CDRx) **/
#define AFEC0_AFEC_ISR_EOC2		(1 << 2)
/** AFEC0_AFEC_ISR_EOC1 End of Conversion 1 (cleared by reading AFEC_CDRx) **/
#define AFEC0_AFEC_ISR_EOC1		(1 << 1)
/** AFEC0_AFEC_ISR_EOC0 End of Conversion 0 (cleared by reading AFEC_CDRx) **/
#define AFEC0_AFEC_ISR_EOC0		(1 << 0)

/**@}*/

/** @defgroup afec0_afec_over AFECOVER AFEC Overrun Status Register
@{*/

/** AFEC0_AFEC_OVER_OVRE11 Overrun Error 11 **/
#define AFEC0_AFEC_OVER_OVRE11		(1 << 11)
/** AFEC0_AFEC_OVER_OVRE10 Overrun Error 10 **/
#define AFEC0_AFEC_OVER_OVRE10		(1 << 10)
/** AFEC0_AFEC_OVER_OVRE9 Overrun Error 9 **/
#define AFEC0_AFEC_OVER_OVRE9		(1 << 9)
/** AFEC0_AFEC_OVER_OVRE8 Overrun Error 8 **/
#define AFEC0_AFEC_OVER_OVRE8		(1 << 8)
/** AFEC0_AFEC_OVER_OVRE7 Overrun Error 7 **/
#define AFEC0_AFEC_OVER_OVRE7		(1 << 7)
/** AFEC0_AFEC_OVER_OVRE6 Overrun Error 6 **/
#define AFEC0_AFEC_OVER_OVRE6		(1 << 6)
/** AFEC0_AFEC_OVER_OVRE5 Overrun Error 5 **/
#define AFEC0_AFEC_OVER_OVRE5		(1 << 5)
/** AFEC0_AFEC_OVER_OVRE4 Overrun Error 4 **/
#define AFEC0_AFEC_OVER_OVRE4		(1 << 4)
/** AFEC0_AFEC_OVER_OVRE3 Overrun Error 3 **/
#define AFEC0_AFEC_OVER_OVRE3		(1 << 3)
/** AFEC0_AFEC_OVER_OVRE2 Overrun Error 2 **/
#define AFEC0_AFEC_OVER_OVRE2		(1 << 2)
/** AFEC0_AFEC_OVER_OVRE1 Overrun Error 1 **/
#define AFEC0_AFEC_OVER_OVRE1		(1 << 1)
/** AFEC0_AFEC_OVER_OVRE0 Overrun Error 0 **/
#define AFEC0_AFEC_OVER_OVRE0		(1 << 0)

/**@}*/

/** @defgroup afec0_afec_cwr AFECCWR AFEC Compare Window Register
@{*/


#define AFEC0_AFEC_CWR_HIGHTHRES_SHIFT		16
#define AFEC0_AFEC_CWR_HIGHTHRES_MASK		0xffff
/** @defgroup afec0_afec_cwr_highthres HIGHTHRES High Threshold
@{*/
/**@}*/


#define AFEC0_AFEC_CWR_LOWTHRES_SHIFT		0
#define AFEC0_AFEC_CWR_LOWTHRES_MASK		0xffff
/** @defgroup afec0_afec_cwr_lowthres LOWTHRES Low Threshold
@{*/
/**@}*/


/**@}*/

/** @defgroup afec0_afec_cgr AFECCGR AFEC Channel Gain Register
@{*/


#define AFEC0_AFEC_CGR_GAIN11_SHIFT		22
#define AFEC0_AFEC_CGR_GAIN11_MASK		0x03
/** @defgroup afec0_afec_cgr_gain11 GAIN11 Gain for Channel 11
@{*/
/**@}*/


#define AFEC0_AFEC_CGR_GAIN10_SHIFT		20
#define AFEC0_AFEC_CGR_GAIN10_MASK		0x03
/** @defgroup afec0_afec_cgr_gain10 GAIN10 Gain for Channel 10
@{*/
/**@}*/


#define AFEC0_AFEC_CGR_GAIN9_SHIFT		18
#define AFEC0_AFEC_CGR_GAIN9_MASK		0x03
/** @defgroup afec0_afec_cgr_gain9 GAIN9 Gain for Channel 9
@{*/
/**@}*/


#define AFEC0_AFEC_CGR_GAIN8_SHIFT		16
#define AFEC0_AFEC_CGR_GAIN8_MASK		0x03
/** @defgroup afec0_afec_cgr_gain8 GAIN8 Gain for Channel 8
@{*/
/**@}*/


#define AFEC0_AFEC_CGR_GAIN7_SHIFT		14
#define AFEC0_AFEC_CGR_GAIN7_MASK		0x03
/** @defgroup afec0_afec_cgr_gain7 GAIN7 Gain for Channel 7
@{*/
/**@}*/


#define AFEC0_AFEC_CGR_GAIN6_SHIFT		12
#define AFEC0_AFEC_CGR_GAIN6_MASK		0x03
/** @defgroup afec0_afec_cgr_gain6 GAIN6 Gain for Channel 6
@{*/
/**@}*/


#define AFEC0_AFEC_CGR_GAIN5_SHIFT		10
#define AFEC0_AFEC_CGR_GAIN5_MASK		0x03
/** @defgroup afec0_afec_cgr_gain5 GAIN5 Gain for Channel 5
@{*/
/**@}*/


#define AFEC0_AFEC_CGR_GAIN4_SHIFT		8
#define AFEC0_AFEC_CGR_GAIN4_MASK		0x03
/** @defgroup afec0_afec_cgr_gain4 GAIN4 Gain for Channel 4
@{*/
/**@}*/


#define AFEC0_AFEC_CGR_GAIN3_SHIFT		6
#define AFEC0_AFEC_CGR_GAIN3_MASK		0x03
/** @defgroup afec0_afec_cgr_gain3 GAIN3 Gain for Channel 3
@{*/
/**@}*/


#define AFEC0_AFEC_CGR_GAIN2_SHIFT		4
#define AFEC0_AFEC_CGR_GAIN2_MASK		0x03
/** @defgroup afec0_afec_cgr_gain2 GAIN2 Gain for Channel 2
@{*/
/**@}*/


#define AFEC0_AFEC_CGR_GAIN1_SHIFT		2
#define AFEC0_AFEC_CGR_GAIN1_MASK		0x03
/** @defgroup afec0_afec_cgr_gain1 GAIN1 Gain for Channel 1
@{*/
/**@}*/


#define AFEC0_AFEC_CGR_GAIN0_SHIFT		0
#define AFEC0_AFEC_CGR_GAIN0_MASK		0x03
/** @defgroup afec0_afec_cgr_gain0 GAIN0 Gain for Channel 0
@{*/
/**@}*/


/**@}*/

/** @defgroup afec0_afec_diffr AFECDIFFR AFEC Channel Differential Register
@{*/

/** AFEC0_AFEC_DIFFR_DIFF11 Differential inputs for channel 11 **/
#define AFEC0_AFEC_DIFFR_DIFF11		(1 << 11)
/** AFEC0_AFEC_DIFFR_DIFF10 Differential inputs for channel 10 **/
#define AFEC0_AFEC_DIFFR_DIFF10		(1 << 10)
/** AFEC0_AFEC_DIFFR_DIFF9 Differential inputs for channel 9 **/
#define AFEC0_AFEC_DIFFR_DIFF9		(1 << 9)
/** AFEC0_AFEC_DIFFR_DIFF8 Differential inputs for channel 8 **/
#define AFEC0_AFEC_DIFFR_DIFF8		(1 << 8)
/** AFEC0_AFEC_DIFFR_DIFF7 Differential inputs for channel 7 **/
#define AFEC0_AFEC_DIFFR_DIFF7		(1 << 7)
/** AFEC0_AFEC_DIFFR_DIFF6 Differential inputs for channel 6 **/
#define AFEC0_AFEC_DIFFR_DIFF6		(1 << 6)
/** AFEC0_AFEC_DIFFR_DIFF5 Differential inputs for channel 5 **/
#define AFEC0_AFEC_DIFFR_DIFF5		(1 << 5)
/** AFEC0_AFEC_DIFFR_DIFF4 Differential inputs for channel 4 **/
#define AFEC0_AFEC_DIFFR_DIFF4		(1 << 4)
/** AFEC0_AFEC_DIFFR_DIFF3 Differential inputs for channel 3 **/
#define AFEC0_AFEC_DIFFR_DIFF3		(1 << 3)
/** AFEC0_AFEC_DIFFR_DIFF2 Differential inputs for channel 2 **/
#define AFEC0_AFEC_DIFFR_DIFF2		(1 << 2)
/** AFEC0_AFEC_DIFFR_DIFF1 Differential inputs for channel 1 **/
#define AFEC0_AFEC_DIFFR_DIFF1		(1 << 1)
/** AFEC0_AFEC_DIFFR_DIFF0 Differential inputs for channel 0 **/
#define AFEC0_AFEC_DIFFR_DIFF0		(1 << 0)

/**@}*/

/** @defgroup afec0_afec_cselr AFECCSELR AFEC Channel Selection Register
@{*/


#define AFEC0_AFEC_CSELR_CSEL_SHIFT		0
#define AFEC0_AFEC_CSELR_CSEL_MASK		0x0f
/** @defgroup afec0_afec_cselr_csel CSEL Channel Selection
@{*/
/**@}*/


/**@}*/

